cf_billing/AccumulationRegisters/бестОбъемНачисленийНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бестОбъемНачисленийНП</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбъемПоПрибору</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемУслугиПотребленный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЧасовШтатнойРаботыПУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемДосчитанный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>7</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемМГВ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>7</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЧасовРаботыТУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальныеПоказания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонечныеПоказания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПлощади</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаПотребления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетПоФормуле</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗависимаяТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентРасчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДифференцированности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыДифференцированности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеНагрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеНормативаЗаДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектУчаствуетВРаспределенииМКД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчетаНорматива</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестТипыНачисленияПоНормативуНП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемператураВнутриПомещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписатьИзНормы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовыщающийКоэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоставнаяУслуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПрименятьСезонность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлощадьМОП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлощадьАбонентов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлощадьСобственнаяПоставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетПоФактическомуПотреблению</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НедопускПУККоммерческомуУчету</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеЗарегистрированногоОбъема</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДиаметрСечения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргГруппыПотребителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСВнутри</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДопНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДопНачисления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестТипыДополнительныхНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорнойКоэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСпособНачислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шкала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Распределение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДолевоеРаспределение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеТарифа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/Enums/бестТипыНачисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бестТипыНачисления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеНаУК</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Enums/бестРазделыЗаписиНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бестРазделыЗаписиНП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СтабильныеПериодыНП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзаиморасчетыНП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачисленияПоДолевымСхемам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Enums/энргВидыНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргВидыНачислений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеОДН</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/AccumulationRegisters/бестОбъемНачисленийНП/Ext/RecordSetModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
			
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
		
	Регистратор 						= ЭтотОбъект.Отбор.Регистратор.Значение;
	
	ИнициализироватьДополнительныеСвойства(Регистратор);
		
	Если ЭтотОбъект.Количество() > 0 Тогда
		ДобавитьОтложенныеДвижения(Регистратор);
		ДобавитьЗависимыеДанные(Регистратор);
	КонецЕсли;
	
	энргНачисления.ЗаписатьНаборыЗаписей(ДополнительныеСвойства.НаборыЗаписей);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьДополнительныеСвойства(Регистратор)
	
	Если ДополнительныеСвойства.Свойство("ДатаРегистратора") Тогда
		ДатаРегистратора 				= ДополнительныеСвойства.ДатаРегистратора;
	Иначе
		ДополнительныеСвойства.Вставить("ДатаРегистратора", Регистратор.Дата);
	КонецЕсли;	
	
	Если ДополнительныеСвойства.Свойство("Организация") Тогда
		Организация 					= ДополнительныеСвойства.Организация;
	ИначеЕсли  ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Регистратор,"Организация") Тогда
		ДополнительныеСвойства.Вставить("Организация", Регистратор.Организация);
	Иначе
		ДополнительныеСвойства.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
	КонецЕсли;

	Если ДополнительныеСвойства.Свойство("Район") Тогда
		Район 							= ДополнительныеСвойства.Район;
	ИначеЕсли  ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Регистратор,"Район") Тогда
		ДополнительныеСвойства.Вставить("Район", Регистратор.Район);
	Иначе
		ДополнительныеСвойства.Вставить("Район", Справочники.энргЗоныОтвественности.ПустаяСсылка());
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("МКД") Тогда
		МКД 						= ДополнительныеСвойства.МКД;
	ИначеЕсли Регистратор.Метаданные().Реквизиты.Найти("МКД") <> Неопределено Тогда                               
		ДополнительныеСвойства.Вставить("МКД", Регистратор.МКД);
	КонецЕсли;


	РазделыЗаписи 						= Новый Массив;
	
	Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.бестНачислениеНП") Тогда
		Если Регистратор.ТипНачисления = Перечисления.бестТипыНачисления.Начисление Тогда
			РазделыЗаписи.Добавить(Новый Структура("Раздел, ПериодНачисления", Перечисления.бестРазделыЗаписиНП.СтабильныеПериодыНП, КонецМесяца(ДополнительныеСвойства.ДатаРегистратора)+1));
			РазделыЗаписи.Добавить(Новый Структура("Раздел, ПериодНачисления", Перечисления.бестРазделыЗаписиНП.НачисленияПоДолевымСхемам, НачалоМесяца(ДополнительныеСвойства.ДатаРегистратора)));
		КонецЕсли;
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.бестНачислениеПоСхемамСтруктурыСети") Тогда
		РазделыЗаписи.Добавить(Новый Структура("Раздел, ПериодНачисления", Перечисления.бестРазделыЗаписиНП.СтабильныеПериодыНП, КонецМесяца(ДополнительныеСвойства.ДатаРегистратора)+1));
	КонецЕсли;

	ДополнительныеСвойства.Вставить("РазделыЗаписи", РазделыЗаписи);

	НаборыЗаписей  						= Новый Структура;
		
	Если РазделыЗаписи.Количество() > 0 Тогда
		НаборОтложенныеДвижения 			= РегистрыСведений.бестОтложенныеДвиженияДокументовНП.СоздатьНаборЗаписей();
		НаборОтложенныеДвижения.Отбор.ДокРегистратор.Установить(Регистратор);		
		НаборыЗаписей.Вставить("бестОтложенныеДвиженияДокументовНП", 		НаборОтложенныеДвижения);
				
		НачисленныйСреднийОбъем 			= РегистрыНакопления.бестНачисленныйСреднийОбъемНП.СоздатьНаборЗаписей();
		НачисленныйСреднийОбъем.Отбор.Регистратор.установить(Регистратор);
		НачисленныйСреднийОбъем.ДополнительныеСвойства.Вставить("ЗаписьРазрешена", Истина);		
		НаборыЗаписей.Вставить("бестНачисленныйСреднийОбъемНП", 	НачисленныйСреднийОбъем);		
	КонецЕсли;
      		
	ДополнительныеСвойства.Вставить("НаборыЗаписей", НаборыЗаписей);

КонецПроцедуры

Функция ДанныеВзаиморасчеты(Регистратор)
	
	Регистратор 					= ЭтотОбъект.Отбор.Регистратор.Значение;
	Запрос 							= Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", 	Регистратор);
	Запрос.УстановитьПараметр("Дата", 			ДополнительныеСвойства.ДатаРегистратора);
	Запрос.УстановитьПараметр("Организация", 	ДополнительныеСвойства.Организация);
	Запрос.УстановитьПараметр("Район", 			ДополнительныеСвойства.Район);
	Запрос.Текст 					= 
	"ВЫБРАТЬ
	|	бестОбъемНачисленийНП.СпособНачисления КАК СпособНачисления,
	|	ЗНАЧЕНИЕ(Перечисление.энргВидыНачислений.Начисление) КАК ВидНачисления,
	|	бестОбъемНачисленийНП.Услуга КАК Услуга,
	|	бестОбъемНачисленийНП.ТочкаУчета КАК ТочкаУчета,
	|	бестОбъемНачисленийНП.ПриборУчета КАК ПриборУчета,
	|	бестОбъемНачисленийНП.ТарифнаяЗона КАК ТарифнаяЗона,
	|	бестОбъемНачисленийНП.ОбъемУслуги КАК ОбъемУслуги,
	|	&Организация КАК Организация,
	|	бестОбъемНачисленийНП.Договор КАК Договор,
	|	&Дата КАК Период,
	|	бестОбъемНачисленийНП.ОбъектРасчета.МКД КАК МКД,
	|	&Район КАК Район,
	|	бестОбъемНачисленийНП.НачалоПериода КАК НачалоПериода,
	|	бестОбъемНачисленийНП.КонецПериода КАК КонецПериода,
	|	бестОбъемНачисленийНП.НачальныеПоказания КАК НачальныеПоказания,
	|	бестОбъемНачисленийНП.КонечныеПоказания КАК КонечныеПоказания,
	|	бестОбъемНачисленийНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестОбъемНачисленийНП.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	бестОбъемНачисленийНП.Поставщик КАК Поставщик,
	|	бестОбъемНачисленийНП.Шкала КАК Шкала,
	|	бестОбъемНачисленийНП.Сумма КАК Сумма,
	|	бестОбъемНачисленийНП.ЗначениеТарифа КАК ЗначениеТарифа,
	|	бестОбъемНачисленийНП.НаличиеЗарегистрированногоОбъема КАК НаличиеЗарегистрированногоОбъема
	|ИЗ
	|	РегистрНакопления.бестОбъемНачисленийНП КАК бестОбъемНачисленийНП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|		ПО бестОбъемНачисленийНП.ПриборУчета = энргПриборыУчетаАбонента.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО бестОбъемНачисленийНП.Услуга = энргВидыУслуг.Ссылка
	|ГДЕ
	|	бестОбъемНачисленийНП.Регистратор = &Регистратор
	|	И бестОбъемНачисленийНП.ОбъемУслуги <> 0
	|	И (НЕ энргПриборыУчетаАбонента.РегистрируетОбъем
	|			ИЛИ энргВидыУслуг.СпособДосчётаРесурса = ЗНАЧЕНИЕ(Перечисление.бестСпособыДосчётаРесурса.ПустаяСсылка))
	|ИТОГИ
	|	СУММА(ОбъемУслуги),
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(Договор),
	|	МАКСИМУМ(Период),
	|	МАКСИМУМ(Район),
	|	СУММА(ОбъемУслугиПотребленный)
	|ПО
	|	ОбъектРасчета,
	|	Услуга,
	|	ТочкаУчета"; 	
	Результат 						= Запрос.Выполнить();
	Возврат  Результат;
КонецФункции

Процедура ДобавитьОтложенныеДвижения(Регистратор)
	
	перем НаборОтложенныеДвижения;
	
	НаборыЗаписей 						= ДополнительныеСвойства.НаборыЗаписей;
	
	Если Не НаборыЗаписей.Свойство("бестОтложенныеДвиженияДокументовНП", НаборОтложенныеДвижения) Тогда
		Возврат;
	КонецЕсли;
		
	РазделыЗаписи 						= ДополнительныеСвойства.РазделыЗаписи;
		
	Для Каждого СтрокаРаздела Из РазделыЗаписи Цикл	    
		НоваяЗапись 					= НаборОтложенныеДвижения.Добавить();
		НоваяЗапись.Организация		 	= ДополнительныеСвойства.Организация;
		НоваяЗапись.ПериодНачисления 	= СтрокаРаздела.ПериодНачисления;
		НоваяЗапись.Район 				= ДополнительныеСвойства.Район;
		НоваяЗапись.МКД 				= ДополнительныеСвойства.МКД;
		НоваяЗапись.РазделЗаписи 		= СтрокаРаздела.Раздел;
		НоваяЗапись.ДокРегистратор 		= Регистратор;
		НоваяЗапись.ДатаРегистратора 	= ДополнительныеСвойства.ДатаРегистратора;	
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьЗависимыеДанные(Регистратор) 
	
	перем НаборВзаиморасчеты, НачисленныйСредний;
	
	НаборыЗаписей 											= ДополнительныеСвойства.НаборыЗаписей;
		
	Если НЕ НаборыЗаписей.Свойство("бестНачисленныйСреднийОбъемНП", НачисленныйСредний) Тогда
		Возврат;
	КонецЕсли;   	
	
	Результат 												= ДанныеВзаиморасчеты(Регистратор);
	ВыборкаАбонент  										= Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВидОперацииПоСреднему  									= Перечисления.энргСпособНачислений.НачислениеПоСреднему;
	ВидОперацииПоСреднемуНормативу 							= Перечисления.энргСпособНачислений.СреднееПоНормативу;
	
	Пока ВыборкаАбонент.Следующий() цикл
				
		ВыборкаУслуга  										= ВыборкаАбонент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаУслуга.Следующий() цикл
				
			ВыборкаТочкаУчета 								= ВыборкаУслуга.выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаТочкаУчета.следующий() цикл
							
					ДетальнаяВыборка  						= ВыборкаТочкаУчета.Выбрать();
					Пока ДетальнаяВыборка.Следующий() цикл
						// Записываем объем потреления.
						Если НЕ ДетальнаяВыборка.НаличиеЗарегистрированногоОбъема И (ДетальнаяВыборка.СпособНачисления = ВидОперацииПоСреднему или ДетальнаяВыборка.СпособНачисления = ВидОперацииПоСреднемуНормативу) тогда
							Запись  						= НачисленныйСредний.ДобавитьПриход();
							ЗаполнитьЗначенияСвойств(Запись,ДетальнаяВыборка);
							Запись.ПериодНачисления 		= НачалоМесяца(ДополнительныеСвойства.ДатаРегистратора);
						КонецЕсли;	
						
					КонецЦикла;
				//КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

		
КонецПроцедуры

#КонецОбласти
